<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Creating a custom ID using string functions
© ExploreAI Academy

In this notebook, we will learn how to use string functions to create a customised country ID column. We will also use string functions to give our customised column uniformity.

> ⚠️ This notebook will not run on Google Colab because it cannot connect to a local database. Please make sure that this notebook is running on the same local machine as your MySQL Workbench installation and MySQL `united_nations` database.

## Learning objectives

In this train, we will learn how to:
- Use string functions to create a customised country ID column.
- Use string functions to give our customised column uniformity.

## Overview

Suppose that, as a general guideline, the project we are working on requires that all data IDs be created by combining existing table attributes. In the process of working with the `Access_to_Basic_Services` table, we make the decision to form custom country IDs by combining the country name, year, and population size in millions for each entry.

## Connecting to the MySQL database

We'll start by connecting to the united_nations database. To connect to the MySQL server, run the cells below.

In [3]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://root:Zaki%4020017777@127.0.0.1:3306/united_nations

'Connected: root@united_nations'


To accomplish this, our initial step involves selecting the specific columns we want to incorporate, namely the `Country_name`, `Time_period`, and `Est_population_in_millions` from the `Access_to_Basic_Services` table.

In [6]:
%%sql

SELECT 
	DISTINCT Country_name, 
	Time_period, 
	Est_population_in_millions
FROM 
	united_nations.Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Kazakhstan', 2015, Decimal('17.542806')),
 ('Kazakhstan', 2016, Decimal('17.794055')),
 ('Kazakhstan', 2017, Decimal('18.037776')),
 ('Kazakhstan', 2018, Decimal('18.276452')),
 ('Kazakhstan', 2019, Decimal('18.513673'))]

## Exercise

### 1. Combine the columns

Create the new ID by combining the columns `Country_name`, `Time_period`, and `Est_population_in_millions`. Save this as `Country_id`.

In [9]:
%%sql

SELECT 
	DISTINCT Country_name, 
	Time_period, 
	Est_population_in_millions,
    CONCAT(
        Country_name, 
        Time_period, 
        Est_population_in_millions
    ) AS Country_id
FROM 
	united_nations.Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Kazakhstan', 2015, Decimal('17.542806'), 'Kazakhstan201517.542806'),
 ('Kazakhstan', 2016, Decimal('17.794055'), 'Kazakhstan201617.794055'),
 ('Kazakhstan', 2017, Decimal('18.037776'), 'Kazakhstan201718.037776'),
 ('Kazakhstan', 2018, Decimal('18.276452'), 'Kazakhstan201818.276452'),
 ('Kazakhstan', 2019, Decimal('18.513673'), 'Kazakhstan201918.513673')]

### 2. Replace the NULL values

We will notice right away that this method works fine unless we encounter a `NULL` (`None`) value in any of the columns. A single `NULL` would make the entire `Country_id` string `NULL`, and that's not what we want.

Refine the solution by replacing all `NULL` values of the combined columns with the word `UNKNOWN`.

In [11]:
%%sql

SELECT 
	DISTINCT Country_name, 
	Time_period, 
	Est_population_in_millions,
    CONCAT(
        IFNULL(Country_name,'UNKNOWN'), 
        IFNULL(Time_period,'UNKNOWN'), 
        IFNULL(Est_population_in_millions,'UNKNOWN')
    ) AS Country_id
FROM 
	united_nations.Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Kazakhstan', 2015, Decimal('17.542806'), 'Kazakhstan201517.542806'),
 ('Kazakhstan', 2016, Decimal('17.794055'), 'Kazakhstan201617.794055'),
 ('Kazakhstan', 2017, Decimal('18.037776'), 'Kazakhstan201718.037776'),
 ('Kazakhstan', 2018, Decimal('18.276452'), 'Kazakhstan201818.276452'),
 ('Kazakhstan', 2019, Decimal('18.513673'), 'Kazakhstan201918.513673')]

### 3a. Make the custom IDs consistent

Let's make the custom IDs consistent. We will do this in two steps. First, convert all the letters in each ID to uppercase.

In [12]:
%%sql

SELECT 
	DISTINCT Country_name, 
	Time_period, 
	Est_population_in_millions,
    CONCAT(
        IFNULL(UPPER(Country_name),'UNKNOWN'), 
        IFNULL(Time_period,'UNKNOWN'), 
        IFNULL(Est_population_in_millions,'UNKNOWN')
    ) AS Country_id
FROM 
	united_nations.Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Kazakhstan', 2015, Decimal('17.542806'), 'KAZAKHSTAN201517.542806'),
 ('Kazakhstan', 2016, Decimal('17.794055'), 'KAZAKHSTAN201617.794055'),
 ('Kazakhstan', 2017, Decimal('18.037776'), 'KAZAKHSTAN201718.037776'),
 ('Kazakhstan', 2018, Decimal('18.276452'), 'KAZAKHSTAN201818.276452'),
 ('Kazakhstan', 2019, Decimal('18.513673'), 'KAZAKHSTAN201918.513673')]

### 3b. Make the custom IDs consistent

The second way we'll make the IDs consistent is by ensuring that all the IDs have the same length.

Use the first four characters of the `Country_name` and `Time_period` fields, then use the last 7 characters of the `Est_population_in_millions`.

In [13]:
%%sql

SELECT 
	DISTINCT Country_name, 
	Time_period, 
	Est_population_in_millions,
    CONCAT(
        SUBSTRING(IFNULL(UPPER(Country_name),'UNKNOWN'),1,4), 
        SUBSTRING(IFNULL(Time_period,'UNKNOWN'),1,4), 
        SUBSTRING(IFNULL(Est_population_in_millions,'UNKNOWN'), -7)
    ) AS Country_id
FROM 
	united_nations.Access_to_Basic_Services
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Kazakhstan', 2015, Decimal('17.542806'), 'KAZA2015.542806'),
 ('Kazakhstan', 2016, Decimal('17.794055'), 'KAZA2016.794055'),
 ('Kazakhstan', 2017, Decimal('18.037776'), 'KAZA2017.037776'),
 ('Kazakhstan', 2018, Decimal('18.276452'), 'KAZA2018.276452'),
 ('Kazakhstan', 2019, Decimal('18.513673'), 'KAZA2019.513673')]

## Solutions

### 1. Combine the columns

We've used the `CONCAT` function to combine the required columns.

In [ ]:
%%sql

SELECT 
	DISTINCT Country_name, 
	Time_period, 
	Est_population_in_millions, 
	CONCAT(
		Country_name,
		Time_period,
		Est_population_in_millions
	) AS Country_id 
FROM 
	united_nations.Access_to_Basic_Services;

### 2. Replace the NULL values

The `IFNULL` function checks if the value is `NULL` and replaces it with the specified default value, in this case, `UNKNOWN`.

In [ ]:
%%sql

SELECT 
	DISTINCT Country_name, 
	Time_period, 
	Est_population_in_millions, 
	CONCAT( 
		IFNULL(Country_name, 'UNKNOWN'), 
		IFNULL(Time_period, 'UNKNOWN'), 
		IFNULL(Est_population_in_millions, 'UNKNOWN') 
	) AS Country_id 
FROM 
	united_nations.Access_to_Basic_Services;

### 3a. Make the custom IDs consistent

The uppercase requirement only applies to the `Country_name` column. 


We employ the UPPER function, which enables us to convert the `Country_name` to uppercase.

In [ ]:
%%sql

SELECT 
	DISTINCT Country_name, 
	Time_period, 
	Est_population_in_millions, 
	CONCAT( 
		IFNULL(UPPER(Country_name), 'UNKNOWN'), 
		IFNULL(Time_period, 'UNKNOWN'), 
		IFNULL(Est_population_in_millions, 'UNKNOWN') 
	) AS Country_id 
FROM 
	united_nations.Access_to_Basic_Services;

### 3b. Make the custom IDs consistent

For the length requirement, we use the `SUBSTRING` function.

**NOTE:** A neat trick to fetch the last 7 digits of `Est_population_in_millions` with `SUBSTRING` is by using negative indexing. The very last index of a string can be represented by -1 when using negative indexing. Therefore, the seventh to last index will be -7. Since we are utilising everything after the 7th to last index, we won't have to specify the substring length.

In [ ]:
%%sql

SELECT 
	DISTINCT Country_name, 
	Time_period, 
	Est_population_in_millions, 
	CONCAT( 
		SUBSTRING(IFNULL(UPPER(Country_name), 'UNKNOWN'),1,4), 
		SUBSTRING(IFNULL(Time_period, 'UNKNOWN'),1,4), 
		SUBSTRING(IFNULL(Est_population_in_millions, 'UNKNOWN'),-7) 
	) AS Country_id 
FROM 
	united_nations.Access_to_Basic_Services;

## Summary

With this, we have customised the `Country_ids` to be of a uniform length, that is, 15 characters, as well as a uniform case when it comes to the IDs letter characters.

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>